//********************************//
//! 模块: spi_test
//  功能: spi_master与spi_slave测试模块
//********************************//
module spi_test(
    input  wire                     sys_clk         ,   //? 系统时钟
    input  wire                     sys_rst_n           //? 系统复位，低有效
);

//**************************************// 参数列写         //**********************************//


//**************************************// 信号声明         //**********************************//


//**************************************// 主程序段         //**********************************//



//**************************************// 子模块调用       //**********************************//
spi_master#(
	.CPOL           (1'b1)						,			// 时钟极性控制
	.CPHA           (1'b1)									// 时钟相位控制
)
ins_spi_master
(	
	.sys_clk		()                          ,     		// 时钟信号
	.sys_rst_n		()                          ,   		// 复位信号
                    
	.cs				()                          ,          	// 片选信号
	.sclk			()                          ,        	// 时钟信号输出
	.mosi			()                          ,        	// 主设备输出从设备输入数据线
	.miso			()                          ,        	// 主设备输入从设备输出数据线
                         
	.cs_ctrl		()                          ,     		// 片选控制信号 cs = cs_ctrl
	.clk_div_val	()                          ,          	// 时钟分频值
                     
	.wr_req			()                          ,      		// 写请求信号
	.wr_ack			()                          ,      		// 写应答信号
                      
	.data_tx		()                          ,           // 输入数据
	.data_rx 		()                                     	// 输出数据
);

spi_slave#(
	.CPOL               (1'b1)					,			// 时钟极性控制
	.CPHA               (1'b1)								// 时钟相位控制
)
ins_spi_slave
(	
	.sys_clk		()                          ,     	    // 时钟信号
	.sys_rst_n		()                          ,   	    // 复位信号
                           
	.cs				()                          ,           // 片选信号
	.sclk			()                          ,           // 时钟信号输出
	.mosi			()                          ,           // 主设备输出从设备输入数据线
	.miso			()                          ,           // 主设备输入从设备输出数据线
                    
	.clk_div_val	()                          ,           // 时钟分频值
                            
	.re_ack			()                          ,      	    // 读应答信号
                             
	.data_tx		()                          ,           // 输入数据
	.data_rx 		()                                      // 输出数据
);  
//**************************************// 模块结束         //**********************************//
endmodule
